CSI API ETABS v1
cAnalyze.GetCaseStatus Method
 Retrieves the status for all load cases.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetCaseStatus(
	ref int NumberItems,
	ref string[] CaseName,
	ref int[] Status
)
Function GetCaseStatus (
	ByRef NumberItems As Integer,
	ByRef CaseName As String(),
	ByRef Status As Integer()
) As Integer
Dim instance As cAnalyze
Dim NumberItems As Integer
Dim CaseName As String()
Dim Status As Integer()
Dim returnValue As Integer
returnValue = instance.GetCaseStatus(NumberItems,
	CaseName, Status)
int GetCaseStatus(
	int% NumberItems,
	array<String^>^% CaseName,
	array<int>^% Status
)
abstract GetCaseStatus :
        NumberItems : int byref *
        CaseName : string[] byref *
        Status : int[] byref -> int
Parameters
NumberItems
Type: System.Int32
 The number of load cases for which the status is reported.
CaseName
Type: System.String[]
 This is an array that includes the name of each analysis case for which the status is reported.
Status
Type: System.Int32[]
 This is an array containing integers from 1 to 4, indicating the load case status.
Not run
Could not start
Not finished
Finished
Return Value
Type: Int32
 Returns zero if the status is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim NumberItems As Integer
       Dim CaseName() As String
       Dim Status() As Integer
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'set load case run flag
       ret = SapModel.Analyze.SetRunCaseFlag("MODAL", False)
   'run analysis
       System.IO.Directory.CreateDirectory("c:\CSI_API_temp")
       ret = SapModel.File.Save("C:\CSI_API_temp\example.edb")
       ret = SapModel.Analyze.RunAnalysis
   'get load case status
       ret = SapModel.Analyze.GetCaseStatus(NumberItems, CaseName, Status)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cAnalyze Interface
ETABSv1 Namespace